app/controllers/products_controller.rb

        def index
          render json: Product.all, each_serializer: ProductSerializer
---
SELECT "products".* FROM "products"