app/controllers/users_controller.rb

    def index
      render json: User.all, each_serializer: UserIndexSerializer
---
SELECT "users".* FROM "users"

    def create
    new_user = User.new(user_params)
      if new_user.save
---
INSERT INTO "users" ("first_name", "last_name", "store_name", "email", "password_digest", "username", "phone_number", "address", "state", "zipcode", "gender", "store", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"